<template>
    <div class="contract">
         <!-- <el-alert
            title="请注意"
            description="在发布项目之前，请仔细阅读以下发起者合约，"
            show-icon>
        </el-alert> -->
        <p><i class="fa fa-paper-plane"></i>注意：在发布项目众筹之前，为保护发起者权益，请仔细阅读以下发起者合约。</p>
        <h5>发起者协议</h5>
        <div class="publisherContract">
            <pre>
本发起者协议（“本协议”）由众筹项目发起方（下称“发起者”）与摩点产品的运营管理者及其关联公司（下称“摩点”）在北京共同签署。

发起者应在签署本协议前认真阅读本协议全部内容和条款，尤其是以加粗、黑体、斜体、下划线等方式显著标识的条款。发起者点击“同意并接受”按钮、签署本协议的纸版文件或使用本协议项下服务的，即表示发起者已阅读并理解本协议所有内容，同意并签署了本协议，本协议则立即生效，双方均应遵守本协议约定。 

双方本着自愿、平等、互利原则，经充分协商，就发起者使用摩点产品服务的相关事宜达成如下协议，以昭信守。

第一条  术语和定义

1.1  摩点产品：指摩点运营管理的产品，包括但不限于摩点网站（网址www.modian.com）及其App、微打赏产品及其未来新开发或合作的平台或工具。

1.2  摩点：指摩点产品的运营管理者及其关联公司。

1.3  众筹：指发起者与支持者共同完成项目、实现梦想的行为，在这一过程中支持者出资支持发起者、发起者完成项目并依据项目页面中的约定完成承诺。

1.4  项目：指发起者通过摩点产品发起的、拟通过众筹方式筹资的项目。

1.5  项目页面：指发起者在摩点产品中编辑并发布的项目展示页面，页面中包含了项目名称、项目介绍、众筹期限、众筹目标等内容和信息。

1.6  发起者：指通过摩点产品发起项目的自然人、法人或其他组织。

1.7  支持者：指出资支持项目的自然人、法人或其他组织。

1.8  众筹期限：指发起者确定的项目的募集期间。

1.9  众筹目标：指发起者确定的项目成功的目标。

1.10  募集总金额：指众筹期限届满时所募集到的资金总额。

1.11  众筹成功：指项目众筹期限届满且达到众筹目标。

1.12  众筹失败：指项目众筹期限届满但未能达到众筹目标。

1.13  众筹取消：指众筹期限届满前，发起者主动终止众筹或者摩点根据本协议及相关规则的规定决定终止众筹。

1.14  项目终止：指项目在众筹成功后，发生了以下任一情形：

(a)  发起者明确表示无法发放回报的；

(b)  发起者未按照承诺日期发放回报、逾期达12个月的，并且发起者连续6个月未发布项目更新公告的；

(c)  发起者团队解散或业务调整后不再继续开发、运营项目的；

(d)  项目被举报侵权、违法违规或有其它禁止众筹的情形的；

(e)  摩点无法通过预留信息联络上发起者或者发起者拒绝联络的；

(f)  其它摩点认为项目应当终止的情形。

1.15  项目成功结束：指项目在众筹成功后，发起者向支持者发放完毕全部回报。

1.16  双方：指本协议的签署方，即发起者和摩点。

1.17  项目类别：指摩点所运营管理众筹项目的分类，包括游戏、动漫、影视、音乐、出版、活动、设计、科技、食品、粉丝应援、个人愿望、个人求助、公益众筹及其他。

第二条  特别注意事项

2.1  摩点仅为发起者和支持者之间的众筹提供平台网络空间、技术服务和支持等服务。摩点作为平台方，并不是发起者或支持者中的任何一方，不对发起者或支持者提供任何承诺，包括不对发起者或支持者所提供信息的真实性做出任何承诺或承诺任何回报，众筹仅存在于发起者和支持者之间，使用摩点产品产生的法律后果由发起者和支持者自行承担。

2.2  本协议内容包括协议正文、附件、摩点产品上已经发布和将来可能发布的各类规则（包括但不限于《项目发起指南》、《结算和费率规则》、《退款流程》等）、操作流程、规范、指南等，均为本协议不可分割的一部分，与本协议具有同等效力（另有约定的除外）。

2.3  发起者勾选本协议、签署本协议，或者使用本协议项下服务的，即视为发起者同意并接受本协议的全部内容，本协议即对发起者具有约束力，发起者不得再以未阅读或理解本协议的全部内容为由主张本协议无效或要求撤销本协议。

2.4  摩点有权不时修改本协议及相关规则、流程、指南、规范等，如本协议有任何变更，摩点将以公示形式通知，修改后的协议内容及相关规则即成为本协议的组成部分。发起者继续使用摩点产品服务的，即视为已阅读理解并接受修改后的协议和规则，并受其约束。

2.5  发起者应按照本协议要求行使权利、履行义务，发起者不能接受本协议及相关规则（包括修订后版本）的约定的，应立即停止使用摩点产品的各项服务。

2.6  本协议目前适用的项目类别为游戏、动漫、影视、音乐、出版、活动、设计、科技、食品、其他。

2.7  授权作品，需提供授权证明相关文件。

第三条  发起者资质及行为规范 

3.1  发起者应当是摩点产品的注册用户，并在发起项目时或之前完成必要的身份认证和资质认证，摩点亦可能会根据申请发起的项目类型不同，对发起者需要满足的其他资格进行限定和要求，认证材料及相关文件详见《项目发起指南》和《项目规范》。

3.2  摩点仅对发起者的材料进行形式审查，审查通过不代表摩点对发起者提交资质文件及各类信息资料的真实性、合法性、准确性、及时性的确认，发起者仍应对其提交资料的真实性、合法性、准确性、及时性，以及项目页面中所包含的全部内容和信息承担相应的法律责任。具体资质要求，请参考《众筹资质要求》。

3.3  发起者应提交真实、准确、完整的项目信息（项目信息如有任何更新，应通过摩点产品发布更新公告或通知），并自主上传、发布项目。发起者应妥善保管摩点产品的登录账号和密码（如有），在任何情况下发起者须对在该账号下发生的所有操作（包括但不限于信息披露、发布信息、上传图片或视频、网上点击同意或提交各类规则协议等）承担法律责任。

3.4  发起者应自行承担准备或发布、完成项目而发生的费用，自行缴纳因从事本协议项下行为而产生的相应税款。

3.5  发起者应当向摩点提供其真实姓名或名称、地址和联系方式，并授权摩点为保护支持者利益而使用、公示发起者在摩点留存的资料（包括但不限于发起者留存的认证信息）。

3.6  项目开始众筹后，除非存在保护支持者利益等特殊理由，发起者不得修改项目页面的实质内容（对项目进展的更新等公告除外）。

3.7  发起者应严格按照项目计划执行，并完成《项目发起指南》中规定的义务。

第四条  项目和回报规范

4.1  摩点支持和欢迎有创新性质且具有可执行性的项目，具体的项目要求和回报规范详见摩点的《项目发起指南》及《项目规范》。

4.2  无论如何，发起者发起的项目及回报应符合法律法规的相关规定，并且摩点有权对项目和回报提出特殊要求。

第五条  发起者承诺和保证

5.1  发起者承诺创作者如果是法人机构，则应符合以下条件：

(1)   属于合法设立并有效存续的、有民事行为能力的法人或其他组织；

(2)  拥有能够在中国地区接收人民币汇款的银行卡或者我方规定的第三方支付平台；

(3)  提供必要的证明资质认证，根据项目内容，包括但不限于营业执照副本的复印件、经营许可证的复印件、组织机构代码复印件、法人身份证复印件等证明材料；

(4)  根据项目的发布、执行需求，提供包括但不限于项目相关的证明文件、代理人授权书、专利证书、项目页面说明等；

5.2  发起者如果是自然人，则应符合以下条件：

(1)  发起者必须是年满18周岁，有完全民事责任能力的中国公民。若发起者尚不具备完全民事责任能力，应与网站协商由取得网站认可的代理人进行运作，该代理人承担一切民事责任及法律义务；

(2)  拥有能够在中国地区接收人民币汇款的银行卡或者我方规定的第三方支付平台；

(3)  提供必要的身份认证和资质认证，根据项目内容，有可能包括但不限于：身份证，护照，学历证明等；

(4)  根据项目的发布、执行需求，提供项目相关的证明文件、代理人授权书、专利证书、项目页面说明等。

5.3  发起者不从事任何违反法律法规或侵犯任何第三方权利的行为，包括但不限于不得自行或允许任何第三方使用发起者的账号通过摩点产品从事与下述相关的行为或发布与下述相关的信息：


(1)  侵犯任何第三方的专利、商标、著作权、商业秘密、肖像权或其他合法权利，或违反任何法律或合同的；

(2)  发起者的行为或项目信息是虚假的、误导性的、不准确的；

(3)  发起者的行为或项目信息涉嫌非法、威胁、辱骂、骚扰、诽谤、中伤、欺骗、欺诈、侵权、淫秽、冒犯、亵渎或侵犯他人隐私的；

(4)  未经接收方允许而向接收方发布任何邮件、宣传材料或广告信息；

(5)  进行任何危害信息网络安全的行为，故意传播恶意程序或病毒以及其他破坏、干扰正常网络信息服务的行为；

(6)  其它《项目规范》中列述的禁止行为。

发起者违反上述约定而对第三方造成损害的，发起者应当以自己的名义独立承担所有的法律责任，并应确保摩点免于因此产生损失或费用。如因发起者行为导致摩点产生损失或费用的，摩点有权要求发起者赔偿。

5.4  发起者承诺维持支持者的权益，在项目运营管理中不从事以下行为：

(1)  众筹期间，在其他平台上就同一项目进行众筹或预（销）售；

(2)  项目回报量产后没有优先发放给项目的支持者；

(3)  众筹期间，在项目页面、推广宣传和提供的回报中使用任何其他平台或与其他平台标识相混淆的标识，该标识包括但不限于其他平台及平台商家的名称、商标、专属符号和图像、二维码、包装、装潢。

发起者违反本条约定的，摩点有权暂停、中止或终止发起者的平台使用权或者采取其他限制措施。发起者承诺向摩点支付募集总金额扣除支付费用和平台服务费后金额的20%作为违约金。

5.5  发起者违反承诺和保证的，摩点有权根据相关法律法规采取屏蔽、删除相关违规或侵权信息等技术处理，且摩点有权采取暂停、中止或终止项目以及发起者的平台使用权的措施。对于摩点决定终止的项目，未结算款项将由摩点系统按支付金额比例发回支持者账户，已结算款项首先由项目发起者返还至给摩点账户，然后由摩点平台完成对支持者的退款；如项目发起者拒绝返还已结算款项，支持者有权向发起者进行追索，摩点作为第三方平台，不负有支付义务，并有权依本协议第3.5条授权规定，向项目支持者提供发起者留存的所有材料，以协助支持者维权。



第六条  结算流程、费率和退款规则

6.1  项目适用的结算流程、费率和退款规则详见《结算和费率规则》和《退款流程》。

6.2  根据市场和技术的发展以及公司的运营管理情况，摩点有权不时调整平台服务费率、结算和退款规则。摩点将以在摩点产品中公示等适当方式通知发起者变更情况，发起者有权选择接受或拒绝接受，若发起者拒绝的，应立即停止使用摩点产品的服务，发起者继续使用摩点产品的，即视为发起者同意摩点的规则变更。为免疑义，更新后的规则对于在更新前发布的项目无溯及力。

第七条  纠纷处理

7.1  摩点不对项目的回报发放或回报质量进行任何的担保，若支持者因项目及回报问题与发起者产生纠纷，摩点不承担连带责任，发起者应与支持者友好协商并妥善处理。

7.2  发起者应当尽其最大可能解决纠纷，并指定专人维护其发起项目页面中任何话题区内支持者或其他摩点用户的留言和咨询，包括但不限于线上回复及线下沟通等。

7.3  支持者申请退款的，发起者应与支持者协商解决，根据《退款流程》妥善处理，不得危害支持者的合法权益。

第八条  违规处理和违约责任

8.1  对于违反本协议或摩点规则的发起者，摩点有权对其是否涉嫌违规进行自主判断和认定，并根据该认定结果中止、终止项目及发起者的使用权或采取其他限制措施。

8.2  发起者严重违反本协议、摩点产品规则或违反国家法律法规规定的，摩点有权终止与发起者在现阶段和未来的一切合作，若发起者的行为涉嫌犯罪，摩点将移送司法机关处理。

8.3  发起者违反有关法律法规或者本协议约定的，应按照本协议约定支付违约金。如前述行为导致摩点及其关联方遭受任何损失的，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，发起者应当赔偿摩点及其关联方因此遭受的损失和费用，包括但不限于摩点对支持者或摩点用户的赔偿、行政罚款和相关费用（如律师费、员工薪酬、名誉损失等费用）。

8.4  除本协议另有约定外，任何一方违反本协议项下的陈述、保证和承诺，而使另一方遭受任何诉讼、索赔、纠纷、处罚的，违约方应负责解决，守约方由此产生的费用、责任或经济损失，违约方应当负责赔偿。

8.5  一方发生违约行为的，守约方可以书面通知方式要求违约方在指定期限内停止违约行为并消除影响，若违约方未能按时停止违约行为并消除影响，守约方有权终止本协议。为免疑义，若因摩点自身原因导致发起者遭受损失的，摩点向发起者承担的最大总体责任和赔偿限额以其根据本协议向发起者收取的平台服务费金额为限。

第九条  知识产权

9.1  发起者承诺通过摩点产品发布、上传的所有内容和项目信息以及发放的回报均拥有合法权利，不侵犯任何第三方的肖像权、隐私权、专利权、商标权、著作权等合法权利及其他合同权利；如发起人在项目中声称为共同合作、名人作品、名人合作、使用他人肖像、名人代言、知名IP等，另需提供相应授权证明或产品代言合同。

9.2  发起者在摩点产品发表的任何原创内容和信息（包括但不限于评论、小说、图文作品、音频、视频等内容和信息），著作权均归发起者本人所有。

9.3  为了促进社区的发展，帮助发起者更好地进行宣传和传播，发起者通过摩点产品发布、上传的任何内容，发起者特此授予摩点及其关联方非独家的、可转授权的、不可撤销的、全球通用的、永久的、免费的宣传推广和信息网络传播权利。

9.4  摩点向发起者提供的服务含有受到知识产权及相关法律法规保护的专有保密资料或信息，亦可能受到著作权、商标、专利等相关法律法规的保护。未经摩点或相关权利人书面授权，发起者不得修改、出售、传播该等信息，或加以制作衍生服务或软件，或通过进行还原工程、反向组译及其他方式破译原代码。

第十条  协议解除和终止 

10.1  存在下列情况之一的，摩点可以单方面决定全部或部分中止或终止履行本协议的义务或提供本协议项下的服务，直到解除本协议：

(1)  项目违反法律法规、监管政策或其它适用规定的；

(2)  项目将引发或可能引发摩点运营的重大风险；

(3)  项目存在或可能存在明显危害支持者利益的风险；

(4)  因不可归责于摩点的原因造成项目无法继续进行或者回报无法实现的。

10.2  如发起者在线签署的《用户注册协议》因任何原因终止，则本协议将同时终止。

10.3  因不可归责于摩点的原因造成本协议解除的，在本协议解除前发生的行为所导致的任何赔偿和责任，发起者应完全且独立地承担责任。

10.4  本协议的解除不影响在协议解除前已经众筹成功的项目的效力，发起者应将众筹成功的项目继续履行完毕，或依照约定或本协议的规定对支持者承担责任。

第十一条  适用法律和争议解决

11.1  本协议的签署、解释和执行等事宜均适用中华人民共和国法律（仅为本协议之目的，中华人民共和国不包括香港特别行政区、澳门特别行政区和台湾地区）。

11.2  双方因本协议及其执行或解释等发生争议的，应先友好协商解决，如协商不成的，任何一方均有权向摩点住所地有管辖权的人民法院起诉。

11.3  发起者确认其向摩点提供的联系地址即为送达地址，适用范围包括协议签署时相关文件的寄送、发生纠纷时相关文件和法律文书的送达。

第十二条  其它 

12.1  附件是本协议不可分割的一部分，与本协议正文具有同等法律效力。

12.2  本协议自发起者线上点击“同意并接受”按钮或线下签署纸版协议之日（以孰早为准）起生效，有效期至众筹失败、项目终止或者项目成功结束，并且双方没有任何争议或争议解决完毕之日止。

12.3  本协议任何内容均不构成或者被视为或者被解释为双方存在任何隶属关系、雇佣关系、合营关系、合资关系或者代理关系，发起者不得在与第三方的交易中或广告、宣传中以任何方式被解释成为与摩点具有上述关系。



免责承诺



原创作品：

郑重承诺：我方（项目发起者）在摩点发起的项目，是独立进行研究工作所取得的真实原创性作品，对其享有独立的著作权、专利等相关知识产权。我方承诺并保证，此项目不会侵犯任何他人的知识产权及其他合法权益，此项目中的回报产品符合国家法律及相关法规的有关规定，我方为此项目引起的任何纠纷独立承担法律责任，摩点无义务介入发起人与支持者之间的任何纠纷或发起者与其他任何第三方就服务使用方面产生的纠纷。

授权作品：

郑重承诺：我方（项目发起者）在摩点发起的项目，是经原创方（原创个人/公司/团队）正式授权所取得的真实作品，其中涉及的著作权、专利等相关知识产权均已经得到合法授权。我方承诺并保证，此项目不会侵犯任何他人的知识产权及其他合法权益，此项目中的回报产品符合国家法律及相关法规的有关规定，我方为此项目引起的任何纠纷独立承担法律责任，摩点无义务介入发起人与支持者之间的任何纠纷或发起者与其他任何第三方就服务使用方面产生的纠纷。
            </pre>
        </div>
        <div>
            <el-row>
                <el-checkbox v-model="isAgree">我已阅读以上协议</el-checkbox>
            </el-row>
            <el-row>
                <el-button type="danger" @click="nextStep">下一步</el-button>
            </el-row>
            {{ fnAgree }}
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {
            isAgree:Boolean(sessionStorage.getItem('isAgree')) || false
        }
    },
    computed: {
        fnAgree:function(){
            sessionStorage.setItem('isAgree',this.isAgree)
            return
        }
    },
    methods: {
        nextStep(){
            if(!this.$store.state.user.name){
                this.$message.warning('登录后才能发布项目')
                this.$router.push('/login')
            }else if(!this.isAgree){
                this.$message({
                    type:'warning',
                    message:'同意《发起者协议》后，方能继续下一步'
                })
            }else{
                this.$emit('nextStep',1)
            }
        }
    }
}
</script>
<style lang="scss" scoped>
    .contract{
        // margin:0 auto;
        // width:80%;
        position:relative;
        .el-alert{
            margin-top: 30px;
        }
        >p {
            color: black;
            text-align: center;
            margin: 30px 0;
            >i {
                color: coral;
                margin-right: 10px;
            }
        }
        >h5{
            text-align: center;
            color:black;
            font-size: 18px;
        }
        >.publisherContract{
            height: 700px;
            overflow-y: scroll;
            >pre{
                word-wrap:break-word;
            }
        }
        .el-checkbox{
            margin-top: 20px;
        }
        .el-button{
            position: absolute;
            right:0;
        }
    }
</style>
